doc/jmeter/hotline_t5_perf.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!--
  T5-2 HTTP 端到端压测脚本（Apache JMeter 5.5+）
  用法：
    1) 启动应用：java -jar ai-admin/target/ai-admin.jar（需 MySQL/Redis 就绪）
    2) 命令行压测：
       jmeter -n -t hotline_t5_perf.jmx -Jhost=127.0.0.1 -Jport=8080 -Jthreads=50 -Jramp=30 -Jloops=200 -l result.jtl -e -o report/
    3) 参数（-J 覆盖）：host/port/threads(并发)/ramp(秒,爬坡)/loops(每线程循环)

  场景设计（12345 热线二期）：
    - 采样器1「监控端点/健康」：无鉴权，验证 Prometheus 拉取端点在压测下的吞吐，
      同时压测期间该端点输出的 hotline_* 指标可用于观测系统表现。
    - 采样器2「登录获取Token」：鉴权入口压测（RuoYi /login），拿到 token 后供后续业务接口。
      注：业务接口（话务/ACD/质检）需在登录后用 ${token} 设置 HTTP 头 Authorization，
      现网压测建议按实际坐席账号扩展此处为 CSV 参数化多账号登录。
    - 采样器3「智能体问答/AI 热路径」：压 RAG+LLM 链路（若环境未接 LLM，可先用监控端点跑容量）。

  说明：此脚本为模板，真实业务压测需替换登录账号与业务接口路径，并以 CSV Data Set 参数化
        多坐席/多来电号码，避免单账号缓存穿透与限流干扰。
-->
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="12345热线二期 T5-2 压测" enabled="true">
      <stringProp name="TestPlan.comments">二期健壮与提效 - 端到端压测模板</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="全局变量" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="HOST" elementType="Argument">
            <stringProp name="Argument.name">HOST</stringProp>
            <stringProp name="Argument.value">${__P(host,127.0.0.1)}</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">${__P(port,8080)}</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="热线并发用户组" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${__P(loops,200)}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(threads,50)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(ramp,30)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <!-- 采样器1：Prometheus 监控端点（无鉴权，压测期可被外部同时抓取观测） -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /actuator/prometheus" enabled="true">
          <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/actuator/prometheus</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="HTTP 200 断言" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <!-- 采样器2：健康检查 -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /actuator/health" enabled="true">
          <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/actuator/health</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="UP 断言" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-79305386">UP</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <!-- 结果收集：聚合报告 + 汇总 TPS/响应时间 -->
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="聚合报告" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>